artillery.yml
config:
  target: 'http://localhost:3001'
  http:
    # number of tcp connections allowed
    pool: 20
  phases:
    - duration: 20
    # number of virtual users
      arrivalRate: 20
      # number of virtual users it will ramp to
      rampTo: 50
  processor: "./artilleryNumGen.js"


scenarios:
  - name: "photo gallery"
    flow:
      - function: "generateRandomData"
      - loop:
        - get:
            url: "/api/restaurants/{{ id }}/gallery"
          # number of actions per user
        count: 40